tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
brew "asciiquarium"
brew "bat"
brew "cmatrix"
brew "cowsay"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gh"
brew "go"
brew "htop"
brew "httpie"
brew "lolcat"
brew "mas"
brew "yt-dlp"
brew "mpv"
brew "nano"
brew "neofetch"
brew "neomutt"
brew "neovim"
brew "nerdfetch"
brew "nmap"
brew "node"
brew "openssh"
brew "pandoc"
brew "pipes-sh"
brew "pipx"
brew "poetry"
brew "posting"
brew "powerlevel10k"
brew "python-brotli"
brew "python-distlib"
brew "python-filelock"
brew "python-mutagen"
brew "python-platformdirs"
brew "python-requests"
brew "sherlock"
brew "starship"
brew "stow"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "virtualenv"
brew "vite"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "alacritty"
cask "alt-tab"
cask "appcleaner"
cask "balenaetcher"
cask "betterdisplay"
cask "brave-browser"
cask "capcut"
cask "clop"
cask "displaylink"
cask "docker"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto"
cask "font-source-code-pro"
cask "geekbench"
cask "get-api"
cask "google-chrome@dev"
cask "hot"
cask "iina"
cask "kdenlive"
cask "keyclu"
cask "ledger-live"
cask "minecraft"
cask "mono-mdk-for-visual-studio"
cask "mounty"
cask "obsidian"
cask "qbittorrent"
cask "raspberry-pi-imager"
cask "raycast"
cask "stremio"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
mas "Amphetamine", id: 937984704
mas "Goodnotes", id: 1444383602
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "aykutsarac.jsoncrack-vscode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "jeff-hykin.polacode-2019"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "moyu.snapcode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "oven.bun-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "ritwickdey.liveserver"
vscode "seyyedkhandon.firacode"
vscode "seyyedkhandon.tpack"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
